Revit 2026 API

# AnnotationSymboladdLeader Method

---

add a leader to this annotation symbol.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void addLeader()
```
```vb
Public Sub addLeader
```
```cpp
public:
void addLeader()
```
```fsharp
member addLeader : unit -> unit
```

#### Reference

AnnotationSymbol Class

Autodesk.Revit.DB Namespace